#+STARTUP: hidestars
#+TITLE:Dice of Doom!

In this part of Land of Lisp, we are going to write a reasonably
complex game...in a mixed paradigm style with more emphasis on
functional...with an AI!

But first,  lets ignore that and write some state.

* Dice of Doom: Version 1
This version of the game will consist primarily of a small board and
no dice rolling for match-ups.

Since the AI may look at the board relatively intensively, we will
probably not want to do this with a list, but rather an array. But
since we are storing the status of the board in a list, we will want
a function to make an array with the contents of our board:

#+BEGIN_SRC lisp :exports code :tangle yes
  (defun board-array (lst)
    (make-array *board-hexnum* :initial-contents lst))
#+END_SRC

#+RESULTS:
: BOARD-ARRAY

We also need a board to start the game with, this will happen with a
randomized board according to our global state above.

So:
#+BEGIN_SRC lisp :exports code :tangle yes
  (defun gen-board ()
    (board-array (loop for n below *board-hexnum*
                      collect (list (random *num-players*)
                                    (1+ (random *max-dice*))))))
#+END_SRC

#+RESULTS:
: GEN-BOARD

We also need a way to identify players. Currently a single letter
based on their position is good enough:

#+BEGIN_SRC lisp :exports code :tangle yes
  (defun player-letter (n)
    (code-char (+ 97 n)))
#+END_SRC

#+RESULTS:
: PLAYER-LETTER

Which means that player 0 will be:
#+BEGIN_SRC lisp :exports both
  (player-letter 0)
#+END_SRC

#+RESULTS:
: #\a

